# 1. Берем официальный легковесный образ с установленной Java 21 (твоя JDK)
FROM eclipse-temurin:21-jre-alpine

# 2. Создаем внутри контейнера рабочую папку для нашего биллинга
WORKDIR /app

# 3. Копируем наш скомпилированный JAR-файл из папки target внутрь контейнера
# Название JAR-файла проверь в папке target, если оно отличается — поправь тут
COPY target/*.jar app.jar

# 4. Открываем порт 8080 наружу, чтобы сеть Docker видела наш Tomcat
EXPOSE 8080

# 5. Главная команда: запуск нашего микросервиса при старте контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]
